---
kind: property
id: P:Autodesk.Revit.DB.Material.CutBackgroundPatternColor
zh: 材质、材料
source: html/d3768cd0-a588-f5d7-62a5-53b91e9c08a1.htm
---
# Autodesk.Revit.DB.Material.CutBackgroundPatternColor Property

**中文**: 材质、材料

The color of the material cut background pattern.

## Syntax (C#)
```csharp
public Color CutBackgroundPatternColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null